{
  "_meta": {
    "maxChars": {
      "welcome": 20,
      "readyToPlay": 20,
      "pressContinue": 50,
      "greatJob": 20,
      "onePlusOne": 30
    }
  },
  "en": {
    "welcome": "Welcome!",
    "readyToPlay": "Are you ready to play?",
    "greatJob": "Great job!",
    "pressContinue": "Press the next button to continue.",
    "onePlusOne": "One + One = Two",
    "newGame": "New Game",
    "continue": "Continue",
    "pantry": "Pantry",
    "purchasePan": "Purchase Pan",
    "autoSave": "...Auto Saving Complete",

    "MMAnim1-1": "Welcome to the factory! I’m Catbert, your trusty worker cat, and I’ll be guiding you today",
    "MMAnim1-2": "Our job is to separate boxes of screws from boxes of nuts, and we’ll use magnetism to do it!",
    "MMAnim1-3": "Magnets have two poles: north and south.",
    "MMAnim1-4": "Opposite poles attract, and like poles repel.",
    "MMAnim1-5": "We’ll use this property to guide the boxes!",
    "MMAnim1-6": "Moving the magnet, we can steer the screws to one belt and the nuts to another",
    "MMAnim1-7": "It’ll take precision and quick thinking, but I know you’ve got this!",
    "MMAnim1-8": "Let’s start with a simple setup using a regular magnet to get the hang of it. Ready? Let’s go!",

    "MMAnim2-1": "Great job with the basics! You’ve got a knack for magnet management",
    "MMAnim2-2": "Now, let’s add a new tool to your arsenal: electromagnets",
    "MMAnim2-3": "Electromagnets are magnets that you can turn on and off with electricity",
    "MMAnim2-4": "They’re super useful because we can control their strength and timing!",
    "MMAnim2-5": "By running an electric current through a coil of wire, we create a magnetic field",
    "MMAnim2-6": "Turn off the current, and the magnet stops working. Pretty neat, right?",
    "MMAnim2-7": "If you put the wires on the oposite poles of the baterry",
    "MMAnim2-8": "The magnetic field will be in the oposite direction",
    "MMAnim2-9": "This means you’ll be able to dynamically control which boxes are attracted or repelled",
    "MMAnim2-10": "Use the electromagnet to steer screws to one belt and nuts to the other",
    "MMAnim2-11": "Timing is everything here!",
    "MMAnim2-12": "Let’s see how you handle this next challenge. I’ll be cheering you on!",

    "MMAnim3-1": "Fantastic work! You’re really getting the hang of this. Let’s crank it up one last time!",
    "MMAnim3-2": "For this final task, we’re introducing a dynamo to generate electricity for the electromagnet",
    "MMAnim3-3": "A dynamo converts mechanical energy into electrical energy",
    "MMAnim3-4": "Basically, the faster you spin it, the more electricity it generates",
    "MMAnim3-5": "If you spin it in the oposite direction, the magnetic field will also be reversed",
    "MMAnim3-6": "This is the final test, so give it your all. I’m proud of you already"
  },
  "es": {
    "welcome": "¡Bienvenido!",
    "readyToPlay": "¿Estás listo para jugar?",
    "greatJob": "¡Gran trabajo!",
    "pressContinue": "Presione el botón 'siguiente' para continuar.",
    "onePlusOne": "Uno + Uno = Dos",

    "MMAnim1-1": "¡Bienvenido a la fábrica! Soy Catbert, tu fiel gato trabajador, y hoy seré tu guía",
    "MMAnim1-2": "Nuestro trabajo es separar cajas de tornillos de cajas de tuercas, ¡y usaremos el magnetismo para lograrlo!",
    "MMAnim1-3": "Los imanes tienen dos polos: norte y sur.",
    "MMAnim1-4": "Los polos opuestos se atraen y los polos iguales se repelen.",
    "MMAnim1-5": "¡Usaremos esta propiedad para guiar las cajas!",
    "MMAnim1-6": "Moviendo el imán, podemos dirigir los tornillos a una cinta y las tuercas a otra",
    "MMAnim1-7": "Requerirá precisión y rapidez, ¡pero sé que puedes hacerlo!",
    "MMAnim1-8": "Comencemos con una configuración simple usando un imán común para acostumbrarnos. ¿Listo? ¡Vamos allá!",

    "MMAnim2-1": "¡Gran trabajo con lo básico! Tienes talento para manejar imanes",
    "MMAnim2-2": "Ahora, añadamos una nueva herramienta a tu arsenal: los electroimanes",
    "MMAnim2-3": "Los electroimanes son imanes que puedes encender y apagar con electricidad",
    "MMAnim2-4": "¡Son muy útiles porque podemos controlar su fuerza y el momento en que funcionan!",
    "MMAnim2-5": "Al pasar una corriente eléctrica por un cable enrollado, creamos un campo magnético",
    "MMAnim2-6": "Apaga la corriente, y el imán deja de funcionar. ¡Bastante interesante, verdad?",
    "MMAnim2-7": "Si conectas los cables a los polos opuestos de la batería",
    "MMAnim2-8": "El campo magnético estará en la dirección opuesta",
    "MMAnim2-9": "Esto significa que podrás controlar dinámicamente qué cajas se atraen o se repelen",
    "MMAnim2-10": "Usa el electroimán para dirigir los tornillos a una cinta y las tuercas a otra",
    "MMAnim2-11": "¡Aquí el tiempo lo es todo!",
    "MMAnim2-12": "Veamos cómo manejas este próximo desafío. ¡Te estaré animando!",

    "MMAnim3-1": "¡Trabajo fantástico! Estás dominando esto. ¡Vamos a subir la dificultad una última vez!",
    "MMAnim3-2": "Para esta tarea final, vamos a introducir un dinamo para generar electricidad para el electroimán",
    "MMAnim3-3": "Un dinamo convierte la energía mecánica en energía eléctrica",
    "MMAnim3-4": "Básicamente, cuanto más rápido lo hagas girar, más electricidad genera",
    "MMAnim3-5": "Si lo haces girar en la dirección opuesta, el campo magnético también se invertirá",
    "MMAnim3-6": "Esta es la prueba final, así que da lo mejor de ti. Ya estoy orgulloso de ti"

  },
  "zh": {
    "welcome": "欢迎！",
    "readyToPlay": "你准备好玩吗",
    "greatJob": "做得好！",
    "pressContinue": "按“下一步”按钮继续。",
    "onePlusOne": "一+一=二"
  },
  "jp": {
    "welcome": "ようこそ!",
    "readyToPlay": "あなたは遊ぶ準備ができていますか？",
    "greatJob": "よくやった！",
    "pressContinue": "続行するには '次へ'ボタンを押してください。",
    "onePlusOne": "1 + 1 = 2"
  },
  "ru": {
    "welcome": "Добро пожаловать!",
    "readyToPlay": "Вы готовы играть?",
    "greatJob": "Отличная работа!",
    "pressContinue": "Нажмите следующую кнопку, чтобы продолжить.",
    "onePlusOne": "один + один"
  }
}
