{
  "_meta": {
    "maxChars": {
      "welcome": 20,
      "readyToPlay": 20,
      "pressContinue": 50,
      "greatJob": 20,
      "onePlusOne": 30
    }
  },
  "en": {
    "newGame": "New Game",

    "MMAnim1-1": "Welcome to the factory! I’m Catbert, your trusty worker cat, and I’ll be guiding you today",
    "MMAnim1-2": "Our job is to separate boxes of screws from boxes of nuts, and we’ll use magnetism to do it!",
    "MMAnim1-3": "Magnets have two poles: north and south.",
    "MMAnim1-4": "Opposite poles attract, and like poles repel.",
    "MMAnim1-5": "We’ll use this property to guide the boxes!",
    "MMAnim1-6": "Moving the magnet, we can steer the screws to one belt and the nuts to another",
    "MMAnim1-7": "It’ll take precision and quick thinking, but I know you’ve got this!",
    "MMAnim1-8": "Let’s start with a simple setup using a regular magnet to get the hang of it. Ready? Let’s go!",

    "MMAnim2-1": "Great job with the basics! You’ve got a knack for magnet management",
    "MMAnim2-2": "Now, let’s add a new tool to your arsenal: electromagnets",
    "MMAnim2-3": "Electromagnets are magnets that you can turn on and off with electricity",
    "MMAnim2-4": "They’re super useful because we can control their strength and timing!",
    "MMAnim2-5": "By running an electric current through a coil of wire, we create a magnetic field",
    "MMAnim2-6": "Turn off the current, and the magnet stops working. Pretty neat, right?",
    "MMAnim2-7": "If you put the wires on the oposite poles of the baterry",
    "MMAnim2-8": "The magnetic field will be in the oposite direction",
    "MMAnim2-9": "This means you’ll be able to dynamically control which boxes are attracted or repelled",
    "MMAnim2-10": "Use the electromagnet to steer screws to one belt and nuts to the other",
    "MMAnim2-11": "Timing is everything here!",
    "MMAnim2-12": "Let’s see how you handle this next challenge. I’ll be cheering you on!",

    "MMAnim3-1": "Fantastic work! You’re really getting the hang of this. Let’s crank it up one last time!",
    "MMAnim3-2": "For this final task, we’re introducing a dynamo to generate electricity for the electromagnet",
    "MMAnim3-3": "A dynamo converts mechanical energy into electrical energy",
    "MMAnim3-4": "Basically, the faster you spin it, the more electricity it generates",
    "MMAnim3-5": "If you spin it in the oposite direction, the magnetic field will also be reversed",
    "MMAnim3-6": "This is the final test, so give it your all. I’m proud of you already"
  },
  "es": {
    "newGame": "Nuevo Juego",

    "MMAnim1-1": "¡Bienvenido a la fábrica! Soy Catbert, tu fiel gato trabajador, y hoy seré tu guía",
    "MMAnim1-2": "Nuestro trabajo es separar cajas de tornillos de cajas de tuercas, ¡y usaremos el magnetismo para lograrlo!",
    "MMAnim1-3": "Los imanes tienen dos polos: norte y sur.",
    "MMAnim1-4": "Los polos opuestos se atraen y los polos iguales se repelen.",
    "MMAnim1-5": "¡Usaremos esta propiedad para guiar las cajas!",
    "MMAnim1-6": "Moviendo el imán, podemos dirigir los tornillos a una cinta y las tuercas a otra",
    "MMAnim1-7": "Requerirá precisión y rapidez, ¡pero sé que puedes hacerlo!",
    "MMAnim1-8": "Comencemos con una configuración simple usando un imán común para acostumbrarnos. ¿Listo? ¡Vamos allá!",

    "MMAnim2-1": "¡Gran trabajo con lo básico! Tienes talento para manejar imanes",
    "MMAnim2-2": "Ahora, añadamos una nueva herramienta a tu arsenal: los electroimanes",
    "MMAnim2-3": "Los electroimanes son imanes que puedes encender y apagar con electricidad",
    "MMAnim2-4": "¡Son muy útiles porque podemos controlar su fuerza y el momento en que funcionan!",
    "MMAnim2-5": "Al pasar una corriente eléctrica por un cable enrollado, creamos un campo magnético",
    "MMAnim2-6": "Apaga la corriente, y el imán deja de funcionar. ¡Bastante interesante, verdad?",
    "MMAnim2-7": "Si conectas los cables a los polos opuestos de la batería",
    "MMAnim2-8": "El campo magnético estará en la dirección opuesta",
    "MMAnim2-9": "Esto significa que podrás controlar dinámicamente qué cajas se atraen o se repelen",
    "MMAnim2-10": "Usa el electroimán para dirigir los tornillos a una cinta y las tuercas a otra",
    "MMAnim2-11": "¡Aquí el tiempo lo es todo!",
    "MMAnim2-12": "Veamos cómo manejas este próximo desafío. ¡Te estaré animando!",

    "MMAnim3-1": "¡Trabajo fantástico! Estás dominando esto. ¡Vamos a subir la dificultad una última vez!",
    "MMAnim3-2": "Para esta tarea final, vamos a introducir un dinamo para generar electricidad para el electroimán",
    "MMAnim3-3": "Un dinamo convierte la energía mecánica en energía eléctrica",
    "MMAnim3-4": "Básicamente, cuanto más rápido lo hagas girar, más electricidad genera",
    "MMAnim3-5": "Si lo haces girar en la dirección opuesta, el campo magnético también se invertirá",
    "MMAnim3-6": "Esta es la prueba final, así que da lo mejor de ti. Ya estoy orgulloso de ti"

  },
  "zh": {
    "newGame": "新游戏",

    "MMAnim1-1": "欢迎来到工厂！我是猫伯特，你可靠的工作猫，今天我将引导你完成任务",
    "MMAnim1-2": "我们的任务是将螺丝箱和螺母箱分开，并使用磁力来完成！",
    "MMAnim1-3": "磁铁有两个极：北极和南极。",
    "MMAnim1-4": "相反的极相互吸引，相同的极相互排斥。",
    "MMAnim1-5": "我们将利用这个特性来引导箱子！",
    "MMAnim1-6": "通过移动磁铁，我们可以将螺丝引导到一条传送带上，螺母引导到另一条传送带上",
    "MMAnim1-7": "这需要精准和快速的反应，但我相信你一定能做到！",
    "MMAnim1-8": "让我们从使用普通磁铁的简单设置开始熟悉操作。准备好了吗？出发吧！",

    "MMAnim2-1": "基础部分完成得很棒！你很有管理磁铁的天赋",
    "MMAnim2-2": "现在，让我们为你增加一个新工具：电磁铁",
    "MMAnim2-3": "电磁铁是一种可以通过电流控制开关的磁铁",
    "MMAnim2-4": "它非常有用，因为我们可以控制它的强度和工作时间！",
    "MMAnim2-5": "通过让电流流过线圈，我们可以生成磁场",
    "MMAnim2-6": "关闭电流，磁铁就会停止工作。很神奇，对吧？",
    "MMAnim2-7": "如果将电线连接到电池的相反极",
    "MMAnim2-8": "磁场的方向也会相反",
    "MMAnim2-9": "这意味着你可以动态控制哪些箱子被吸引或排斥",
    "MMAnim2-10": "使用电磁铁将螺丝引导到一条传送带上，将螺母引导到另一条传送带上",
    "MMAnim2-11": "在这里，时机至关重要！",
    "MMAnim2-12": "让我们看看你如何应对接下来的挑战。我会为你加油！",

    "MMAnim3-1": "干得太棒了！你真的掌握了这个技巧。让我们最后再挑战一下！",
    "MMAnim3-2": "在这最后的任务中，我们将引入一个发电机，为电磁铁提供电力",
    "MMAnim3-3": "发电机将机械能转化为电能",
    "MMAnim3-4": "简单来说，转得越快，产生的电力就越多",
    "MMAnim3-5": "如果你反方向旋转，磁场也会反转",
    "MMAnim3-6": "这是最终测试，所以全力以赴吧。我已经为你感到自豪了"
  },
  "jp": {
    "newGame": "新しいゲーム",

    "MMAnim1-1": "工場へようこそ！私はキャットバート、頼れる作業猫で、今日はあなたを案内します",
    "MMAnim1-2": "私たちの仕事は、ネジの箱とナットの箱を分けることです。そして、それを磁力で行います！",
    "MMAnim1-3": "磁石には北極と南極の2つの極があります。",
    "MMAnim1-4": "反対の極は引き合い、同じ極は反発します。",
    "MMAnim1-5": "この特性を使って箱を誘導しましょう！",
    "MMAnim1-6": "磁石を動かして、ネジを一方のベルトに、ナットをもう一方のベルトに送ることができます",
    "MMAnim1-7": "精密さと迅速な判断力が必要ですが、あなたならできると信じています！",
    "MMAnim1-8": "まずは通常の磁石を使った簡単な設定から始めてみましょう。準備はいいですか？行きましょう！",

    "MMAnim2-1": "基礎は完璧です！磁石の操作に才能がありますね",
    "MMAnim2-2": "次に、新しいツールを追加しましょう。それは電磁石です",
    "MMAnim2-3": "電磁石は、電気でオンとオフを切り替えられる磁石です",
    "MMAnim2-4": "とても便利で、強さやタイミングをコントロールできます！",
    "MMAnim2-5": "電流をコイルに流すことで、磁場を作り出します",
    "MMAnim2-6": "電流を止めると、磁石は働かなくなります。すごいでしょう？",
    "MMAnim2-7": "バッテリーの反対の極にワイヤーを接続すると",
    "MMAnim2-8": "磁場の方向が逆になります",
    "MMAnim2-9": "これにより、どの箱が引き寄せられるか、または反発されるかを動的に制御できます",
    "MMAnim2-10": "電磁石を使って、ネジを一方のベルトに、ナットをもう一方のベルトに誘導してください",
    "MMAnim2-11": "ここではタイミングがすべてです！",
    "MMAnim2-12": "次のチャレンジに挑戦してみましょう。応援していますよ！",

    "MMAnim3-1": "素晴らしい仕事です！本当にコツをつかんできましたね。最後のステップに進みましょう！",
    "MMAnim3-2": "この最終タスクでは、電磁石の電力を生成するためにダイナモを導入します",
    "MMAnim3-3": "ダイナモは機械的エネルギーを電気エネルギーに変換します",
    "MMAnim3-4": "簡単に言えば、回転が速ければ速いほど、より多くの電気が生成されます",
    "MMAnim3-5": "逆方向に回転させると、磁場も反転します",
    "MMAnim3-6": "これは最終試験ですので、全力を尽くしてください。すでにあなたを誇りに思っています"
  },
  "ru": {
    "newGame": "Новая Игра",

    "MMAnim1-1": "Добро пожаловать на фабрику! Я Кэтберт, ваш надежный кот-работник, и сегодня я буду вашим гидом",
    "MMAnim1-2": "Наша задача — разделить коробки с винтами и коробки с гайками, и мы будем использовать магнетизм, чтобы сделать это!",
    "MMAnim1-3": "У магнитов есть два полюса: северный и южный.",
    "MMAnim1-4": "Противоположные полюса притягиваются, а одинаковые отталкиваются.",
    "MMAnim1-5": "Мы используем это свойство, чтобы направлять коробки!",
    "MMAnim1-6": "Перемещая магнит, мы можем направлять винты на одну ленту, а гайки на другую",
    "MMAnim1-7": "Это потребует точности и быстроты мышления, но я знаю, что у вас все получится!",
    "MMAnim1-8": "Начнем с простой настройки с обычным магнитом, чтобы освоиться. Готовы? Поехали!",

    "MMAnim2-1": "Отличная работа с основами! У вас талант к управлению магнитами",
    "MMAnim2-2": "Теперь добавим новый инструмент в ваш арсенал: электромагниты",
    "MMAnim2-3": "Электромагниты — это магниты, которые можно включать и выключать с помощью электричества",
    "MMAnim2-4": "Они очень полезны, потому что мы можем контролировать их силу и время работы!",
    "MMAnim2-5": "Пропуская электрический ток через катушку провода, мы создаем магнитное поле",
    "MMAnim2-6": "Отключите ток, и магнит перестанет работать. Здорово, правда?",
    "MMAnim2-7": "Если подключить провода к противоположным полюсам батареи",
    "MMAnim2-8": "Магнитное поле будет направлено в противоположную сторону",
    "MMAnim2-9": "Это значит, что вы сможете динамически контролировать, какие коробки притягиваются или отталкиваются",
    "MMAnim2-10": "Используйте электромагнит, чтобы направлять винты на одну ленту, а гайки на другую",
    "MMAnim2-11": "Здесь главное — это время!",
    "MMAnim2-12": "Посмотрим, как вы справитесь с этим вызовом. Я буду за вас болеть!",

    "MMAnim3-1": "Фантастическая работа! Вы действительно справляетесь. Поднимем сложность в последний раз!",
    "MMAnim3-2": "Для этого финального задания мы вводим динамо, чтобы генерировать электричество для электромагнита",
    "MMAnim3-3": "Динамо преобразует механическую энергию в электрическую",
    "MMAnim3-4": "По сути, чем быстрее вы его вращаете, тем больше электричества оно генерирует",
    "MMAnim3-5": "Если вы вращаете его в противоположную сторону, магнитное поле также будет перевернуто",
    "MMAnim3-6": "Это финальный тест, так что выкладывайтесь на полную. Я уже горжусь вами"
  }
}
